// Задание 17: Объявите и вызовите функцию `print`, которая принимает строку
// выводит её на консоль.

#include <iostream>
using namespace std;

void print(string s) {
    cout << s << endl;
}

int main()
{
    print("Hello!");
    return 0;
}

